EDT/УТ/src/InformationRegisters/ПривязкаМашинКРейсам/ПривязкаМашинКРейсам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПривязкаМашинКРейсам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </resources>
  <resources>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </resources>
  <resources>
    <name>ОтвязанВодитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтвязанЭкспедитор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КтоПривязал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяПривязка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ИнформированиеЭкипажейОбИзмененияхВЗаказах/ИнформированиеЭкипажейОбИзмененияхВЗаказах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнформированиеЭкипажейОбИзмененияхВЗаказах</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </resources>
  <resources>
    <name>СтароеЗначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НовоеЗначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусТрансляцииИзменения</name>
    <type>
      <types>EnumRef.СтатусыТрансляцииИзмененийВЗаказах</types>
    </type>
  </resources>
  <resources>
    <name>УзелМП</name>
    <type>
      <types>ExchangePlanRef.ИзмененияДляМП</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>EnumRef.РеквизитыЗаказа</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/CommonModules/ИнформированиеЭкипажейОбИзмененияхВЗаказахСервер/Module.bsl
//Асеев 05.10.2020 (Задача № 4289)>>>
Процедура ЗаписатьИнформированиеЭкипажейОбИзмененияхВЗаказах(Знач СтруктураПараметров) Экспорт
	
	//Асеев 23.03.2021 (Задача № 4503)>>>
	Если Не СтруктураПараметров.Свойство("Транспорт") Тогда
		//Асеев 23.03.2021 (Задача № 4503)<<<
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Рейс", СтруктураПараметров.Рейс);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПривязкаМашинКРейсамСрезПоследних.Транспорт КАК Транспорт
		|ИЗ
		|	РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних(, Рейс = &Рейс) КАК ПривязкаМашинКРейсамСрезПоследних";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СтруктураПараметров.Вставить("Транспорт", Выборка.Транспорт);
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьРегистра = РегистрыСведений.ИнформированиеЭкипажейОбИзмененияхВЗаказах.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ЗаписьРегистра, СтруктураПараметров);
	ЗаписьРегистра.Записать();
	
КонецПроцедуры
//Асеев 05.10.2020 (Задача № 4289)<<<
